INSERT INTO Department VALUES
(1, 'Маркетинг'),
(2, 'Продажи'),
(3, 'Финансы'),
(4, 'Кадры'),
(5, 'Информационные технологии'),
(6, 'Операции'),
(7, 'Обслуживание клиентов'),
(8, 'Исследования и разработки'),
(9, 'Юридический отдел'),
(10, 'Отдел связи с общественностью');

INSERT INTO city VALUES
(1, 'Москва'),
(2, 'Санкт-Петербург'),
(3, 'Новосибирск'),
(4, 'Екатеринбург'),
(5, 'Краснодар'),
(6, 'Казань');

INSERT INTO Office VALUES
(1, 'ул. Ломоносова, д. 12'),
(2, 'пр. Невский, д. 25'),
(3, 'ул. Пушкина, д. 10'),
(4, 'пр. Ленинградский, д. 15'),
(5, 'ул. Московская, д. 20'),
(6, 'ул. Гагарина, д. 25'),
(1, 'ул. Садовая, д. 7'),
(2, 'наб. канала Грибоедова, д. 15'),
(1, 'ул. Горького, д. 5'),
(4, 'пр. Кирова, д. 20'),
(3, 'ул. Советская, д. 12'),
(1, 'ул. Кирова, д. 10');

INSERT INTO Team VALUES
(1, 5, 'Команда разработки'),
(2, 6, 'Команда тестирования'),
(3, 7, 'Команда дизайна'),
(4, 8, 'Команда маркетинга'),
(5, 9, 'Команда продаж'),
(6, 10, 'Команда поддержки'),
(7, 11, 'Команда аналитики'),
(8, 12, 'Команда управления проектами'),
(9, 13, 'Команда финансов'),
(10, 14, 'Команда юристов');


INSERT INTO Employee VALUES
(1, 'Иванов Иван Иванович', 'ivanov@mail.ru', 50000, 1, 5, 1),
(2, 'Петров Петр Петрович', 'petrov@gmail.com', 45000, 2, 2, 9),
(3, 'Сидорова Ольга Игоревна', 'sidorova@yandex.ru', 55000, 3, 3, 9),
(4, 'Кузнецов Алексей Викторович', 'kuznetsov@mail.ru', 60000, 4, 4, 4),
(5, 'Смирнова Екатерина Сергеевна', 'smirnova@gmail.com', 40000, 5, 5, 5),
(6, 'Новиков Дмитрий Александрович', 'novikov@mail.ru', 55000, 6, 1, 6),
(7, 'Морозова Анастасия Николаевна', 'morozova@yandex.ru', 45000, 1, 2, 3),
(8, 'Васильев Сергей Иванович', 'vasilev@gmail.com', 50000, 2, 3, 4),
(9, 'Федорова Мария Владимировна', 'fedorova@mail.ru', 55000, 3, 4, 5),
(10, 'Медведев Андрей Алексеевич', 'medvedev@gmail.com', 60000, 4, 5, 8),
(11, 'Козлова Татьяна Викторовна', 'kozlova@yandex.ru', 40000, 5, 1, 2),
(12, 'Соколов Артем Сергеевич', 'sokolov@mail.ru', 55000, 6, 2, 3),
(13, 'Никитина Елена Александровна', 'nikitina@gmail.com', 45000, 1, 3, 4),
(14, 'Андреев Игорь Николаевич', 'andreev@mail.ru', 50000, 2, 4, 5),
(15, 'Григорьева Ольга Владимировна', 'grigoreva@yandex.ru', 55000, 3, 5, 10),
(16, 'Дмитриев Павел Андреевич', 'dmitriev@gmail.com', 60000, 4, 1, 2),
(17, 'Калинина Анастасия Дмитриевна', 'kalinina@mail.ru', 40000, 5, 2, 7),
(18, 'Поляков Денис Сергеевич', 'polyakov@gmail.com', 55000, 6, 3, 4),
(19, 'Белова Екатерина Ивановна', 'belova@yandex.ru', 45000, 1, 4, 6),
(20, 'Тимофеев Алексей Николаевич', 'timofeev@mail.ru', 50000, 2, 5, 1),
(21, 'Герасимова Анна Сергеевна', 'gerasimova@gmail.com', 55000, 3, 1, 8),
(22, 'Савельев Михаил Игоревич', 'saveliev@mail.ru', 60000, 4, 2, 10),
(23, 'Тихонова Елена Владимировна', 'tikhonova@yandex.ru', 40000, 5, 3, 4),
(24, 'Комаров Артем Александрович', 'komarov@gmail.com', 55000, 6, 4, 5),
(25, 'Лебедев Дмитрий Викторович', 'lebedev@mail.ru', 45000, 1, 5, 1),
(26, 'Куликова Ольга Алексеевна', 'kulikova@gmail.com', 50000, 2, 1, 10),
(27, 'Макаров Андрей Николаевич', 'makarov@yandex.ru', 55000, 3, 2, 3),
(28, 'Романова Татьяна Сергеевна', 'romanova@mail.ru', 60000, 4, 3, 8),
(29, 'Селезнев Илья Владимирович', 'seleznev@gmail.com', 40000, 5, 4, 5),
(30, 'Егорова Анастасия Александровна', 'egorova@mail.ru', 55000, 6, 5, 1),
(31, 'Крылов Антон Иванович', 'krylov@gmail.com', 45000, 1, 1, 2),
(32, 'Петухова Екатерина Викторовна', 'petukhova@yandex.ru', 50000, 2, 2, 3),
(33, 'Соловьев Иван Сергеевич', 'soloviev@mail.ru', 55000, 3, 3, 9),
(34, 'Королева Ольга Николаевна', 'koroleva@gmail.com', 60000, 4, 4, 5),
(35, 'Миронов Артем Владимирович', 'mironov@mail.ru', 40000, 5, 5, 1),
(36, 'Филиппова Анна Александровна', 'filippova@yandex.ru', 55000, 6, 1, 8),
(37, 'Богданов Дмитрий Игоревич', 'bogdanov@gmail.com', 45000, 1, 2, 3),
(38, 'Степанова Анастасия Сергеевна', 'stepanova@mail.ru', 50000, 2, 3, 4),
(39, 'Гусев Михаил Александрович', 'gusev@yandex.ru', 55000, 3, 4, 7),
(40, 'Киселев Александр Николаевич', 'kiselev@gmail.com', 60000, 4, 5, 1);


INSERT INTO Working_hours VALUES
(1, '2021-09-01 08:00:00', '2021-09-01 20:00:00'),
(1, '2021-09-02 09:00:00', '2021-09-02 18:00:00'),
(2, '2021-09-01 07:30:00', '2021-09-01 19:30:00'),
(2, '2021-09-02 07:30:00', '2021-09-02 16:30:00'),
(3, '2021-09-01 08:30:00', '2021-09-01 16:30:00'),
(3, '2021-09-02 08:30:00', '2021-09-02 17:30:00'),
(4, '2021-09-03 08:00:00', '2021-09-03 18:00:00'),
(4, '2021-09-04 09:00:00', '2021-09-04 18:00:00'),
(5, '2021-09-03 07:30:00', '2021-09-03 17:30:00'),
(5, '2021-09-04 07:30:00', '2021-09-04 16:30:00'),
(6, '2021-09-03 08:30:00', '2021-09-03 18:30:00'),
(6, '2021-09-04 08:30:00', '2021-09-04 17:30:00'),
(1, '2021-09-05 08:00:00', '2021-09-05 20:00:00'),
(1, '2021-09-06 09:00:00', '2021-09-06 18:00:00');


INSERT INTO Jobtitle VALUES
(1, 'Разработчик', 10, 80000),
(2, 'Менеджер проектов', 8, 70000),
(3, 'Аналитик данных', 6, 60000),
(4, 'Специалист по маркетингу', 5, 50000),
(5, 'Координатор по кадрам', 4, 40000),
(6, 'Представитель по продажам', 3, 35000),
(7, 'Работник с клиентами', 2, 30000),
(8, 'Бухгалтер', 7, 65000),
(9, 'Графический дизайнер', 5, 55000),
(10, 'Менеджер по операциям', 9, 75000);


INSERT INTO dummy_table_1 VALUES
(1, 1),
(2, 2),
(3, 3),
(4, 4),
(5, 5),
(6, 6),
(7, 7),
(8, 8),
(9, 9),
(10, 10),
(11, 1),
(12, 2),
(13, 3),
(14, 4),
(15, 5),
(16, 6),
(17, 7),
(18, 8),
(19, 9),
(20, 10),
(21, 1),
(22, 2),
(23, 3),
(24, 4),
(25, 5),
(26, 6),
(27, 7),
(28, 8),
(29, 9),
(30, 10),
(31, 1),
(32, 2),
(33, 3),
(34, 4),
(35, 5),
(36, 6),
(37, 7),
(38, 8),
(39, 9),
(40, 10);

INSERT INTO Project VALUES
(1, 'Увеличить продажи', 10, 15),
(2, 'Запустить новый продукт', 5, 8),
(3, 'Переделать сайт', 15, 20),
(4, 'Расширить рынок', 8, 12),
(5, 'Улучшить опыт клиента', 12, 18),
(6, 'Кампания в социальных сетях', 3, 5),
(7, 'Обновить техническую инфраструктуру', 20, 25),
(8, 'Подготовить новый договор', 7, 10),
(9, 'Создать маркетинговый план', 13, 15),
(10, 'Оптимизировать операции', 18, 20);

INSERT INTO dummy_table_2 VALUES
(1, 3),
(2, 7),
(3, 5),
(4, 9),
(5, 2),
(6, 6),
(7, 1),
(8, 4),
(9, 10),
(10, 8);

INSERT INTO History_of_project VALUES
(1, 'Провести анализ рынка', 'v1', '2021-01-01 10:00:00', '2021-01-31 18:00:00'),
(1, 'Разработать новые маркетинговые стратегии', 'v2', '2021-02-01 10:00:00', '2021-02-28 18:00:00'),
(2, 'Обновить сайт компании', 'v1', '2021-03-01 10:00:00', '2021-03-31 18:00:00'),
(2, 'Провести анализ сайта компании', 'v2', '2021-04-01 10:00:00', '2021-04-30 18:00:00'),
(3, 'Разработать новый дизайн сайта', 'v1', '2021-05-01 10:00:00', '2021-05-31 18:00:00'),
(3, 'Обновить контент на сайте', 'v2', '2021-06-01 10:00:00', '2021-06-30 18:00:00'),
(4, 'Провести анализ новых рынков', 'v1', '2021-07-01 10:00:00', '2021-07-31 18:00:00'),
(4, 'Разработать новые стратегии продвижения на новых рынках', 'v2', '2021-08-01 10:00:00', '2021-08-31 18:00:00'),
(5, 'Провести опрос клиентов', 'v1', '2021-09-01 10:00:00', '2021-09-30 18:00:00'),
(5, 'Разработать новые стратегии улучшения опыта клиента', 'v2', '2021-10-01 10:00:00', '2021-10-31 18:00:00'),
(6, 'Провести анализ социальных сетей', 'v1', '2021-11-01 10:00:00', '2021-11-30 18:00:00'),
(6, 'Внедрить новые стратегии продвижения в социальных сетях', 'v2', '2021-12-01 10:00:00', '2021-12-31 18:00:00'),
(7, 'Провести анализ технической инфраструктуры', 'v1', '2022-01-01 10:00:00', '2022-01-31 18:00:00'),
(7, 'Разработать новые стратегии обновления технической инфраструктуры', 'v2', '2022-02-01 10:00:00', '2022-02-28 18:00:00'),
(8, 'Провести анализ договоров', 'v1', '2022-03-01 10:00:00', '2022-03-31 18:00:00'),
(8, 'Разработать новый договор', 'v2', '2022-04-01 10:00:00', '2022-04-30 18:00:00'),
(9, 'Провести анализ маркетинговых стратегий', 'v1', '2022-05-01 10:00:00', '2022-05-31 18:00:00'),
(9, 'Внедрить новые маркетинговые стратегии', 'v2', '2022-06-01 10:00:00', '2022-06-30 18:00:00'),
(10, 'Разработать новые стратегии оптимизации операций', 'v1', '2022-07-01 10:00:00', '2022-07-31 18:00:00'),
(10, 'Внедрить новые стратегии оптимизации операций', 'v2', '2022-08-01 10:00:00', '2022-08-31 18:00:00');

ALTER TABLE Team
    ADD CONSTRAINT fk_tl_id
        FOREIGN KEY (team_lead_id)
            REFERENCES Employee(staff_id)
            ON DELETE SET NULL
            ON UPDATE CASCADE;